## Index Management

In [1]:
# import libraries
import pandas as pd
import matplotlib.pyplot as plt
from datasets import load_dataset
# load data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()
# cleanup data
df['job_posted_data'] = pd.to_datetime(df['job_posted_date'])

In [11]:
df.sample(5)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills,job_posted_data
,,,,,,,,,,,,,,,,,,
296112,Data Scientist,"REMOTE Data Scientist (Python, Modeling, Prese...","Denver, CO",via LinkedIn,Full-time,False,"Texas, United States",2023-01-24 17:05:41,False,False,United States,year,100000.0,NaN,CyberCoders,"['python', 'r', 'sas', 'sas', 'sql', 'tableau'...","{'analyst_tools': ['sas', 'tableau', 'qlik', '...",2023-01-24 17:05:41
44021,Senior Data Engineer,Sr Data Engineer - ETL,"Huntsville, AL",via Peraton - ICIMS,Full-time,False,Georgia,2023-01-31 07:33:33,False,False,United States,None,NaN,NaN,Peraton,"['scala', 'python', 'java', 'nosql', 'elastics...","{'cloud': ['databricks', 'aws'], 'databases': ...",2023-01-31 07:33:33
312122,Data Engineer,Data Engineer - Business Reporting (m/f/d). Jo...,Germany,via My Valley Jobs Today,Full-time,False,Germany,2023-01-31 17:50:10,True,False,Germany,None,NaN,NaN,BASF Services Europe GmbH,None,None,2023-01-31 17:50:10
122008,Senior Data Engineer,Senior Data Engineer/ £93k / SQL / Python / Ai...,"Warrington, UK",via Big Country Jobs,Full-time,False,United Kingdom,2023-02-05 08:17:30,True,False,United Kingdom,None,NaN,NaN,Gravitas Recruitment Group (Global) Ltd,"['sql', 'python', 'postgresql', 'airflow']","{'databases': ['postgresql'], 'libraries': ['a...",2023-02-05 08:17:30
617829,Data Analyst,Consultant Data Quality F/H,"Rennes, France",via Emplois Trabajo.org,Full-time,False,France,2023-11-02 12:26:35,True,False,France,None,NaN,NaN,Itlink,"['sql', 'aws', 'gcp', 'linux', 'windows', 'ter...","{'cloud': ['aws', 'gcp'], 'os': ['linux', 'win...",2023-11-02 12:26:35

```index.name``` and ```index.dtype```

In [26]:
df.index.name = 'job_index' 
df.index

RangeIndex(start=0, stop=785741, step=1, name='job_index')

In [27]:
df.head()

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills,job_posted_data
job_index,,,,,,,,,,,,,,,,,,
0,Senior Data Engineer,Senior Clinical Data Engineer / Principal Clin...,"Watertown, CT",via Work Nearby,Full-time,False,"Texas, United States",2023-06-16 13:44:15,False,False,United States,None,NaN,NaN,Boehringer Ingelheim,None,None,2023-06-16 13:44:15
1,Data Analyst,Data Analyst,"Guadalajara, Jalisco, Mexico",via BeBee México,Full-time,False,Mexico,2023-01-14 13:18:07,False,False,Mexico,None,NaN,NaN,Hewlett Packard Enterprise,"['r', 'python', 'sql', 'nosql', 'power bi', 't...","{'analyst_tools': ['power bi', 'tableau'], 'pr...",2023-01-14 13:18:07
2,Data Engineer,"Data Engineer/Scientist/Analyst, Mid or Senior...","Berlin, Germany",via LinkedIn,Full-time,False,Germany,2023-10-10 13:14:55,False,False,Germany,None,NaN,NaN,ALPHA Augmented Services,"['python', 'sql', 'c#', 'azure', 'airflow', 'd...","{'analyst_tools': ['dax'], 'cloud': ['azure'],...",2023-10-10 13:14:55
3,Data Engineer,LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ...,"San Antonio, TX",via Diversity.com,Full-time,False,"Texas, United States",2023-07-04 13:01:41,True,False,United States,None,NaN,NaN,Southwest Research Institute,"['python', 'c++', 'java', 'matlab', 'aws', 'te...","{'cloud': ['aws'], 'libraries': ['tensorflow',...",2023-07-04 13:01:41
4,Data Engineer,Data Engineer- Sr Jobs,"Washington, DC",via Clearance Jobs,Full-time,False,Sudan,2023-08-07 14:29:36,False,False,Sudan,None,NaN,NaN,Kristina Daniel,"['bash', 'python', 'oracle', 'aws', 'ansible',...","{'cloud': ['oracle', 'aws'], 'other': ['ansibl...",2023-08-07 14:29:36

In [28]:
df.index.dtype

dtype('int64')

## 3 methods:

1. ```df.reset_index()```
2. ```df.set_index()```
3. ```df.sort_index()```

In [29]:
df_usa = df[df['job_location'] == "United States"]

df_usa

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills,job_posted_data
job_index,,,,,,,,,,,,,,,,,,
26,Data Engineer,Data Engineer,United States,via LinkedIn,Full-time,False,Georgia,2023-09-15 13:56:18,True,False,United States,None,NaN,NaN,Infinite Computer Solutions,None,None,2023-09-15 13:56:18
156,Data Engineer,Data Engineer,United States,via BeBee,Full-time,False,Sudan,2023-11-18 14:20:00,False,False,Sudan,None,NaN,NaN,Tech Tammina,"['sql', 'excel']","{'analyst_tools': ['excel'], 'programming': ['...",2023-11-18 14:20:00
339,Data Engineer,Global Market Leading Energy Firm - Staff Data...,United States,via LinkedIn,Full-time,False,"California, United States",2023-09-22 13:07:57,False,False,United States,year,195000.0,NaN,Xcede,None,None,2023-09-22 13:07:57
372,Data Scientist,Data Scientist/Analyst,United States,via Trabajo.org,Full-time,False,"Texas, United States",2023-03-25 13:05:35,False,False,United States,None,NaN,NaN,Peraton,['python'],{'programming': ['python']},2023-03-25 13:05:35
572,Data Scientist,Data Scientist I,United States,via BeBee,Full-time,False,Sudan,2023-08-21 13:38:16,False,False,Sudan,None,NaN,NaN,MasterCard,"['python', 'r', 'sql', 'hadoop', 'spark', 'ten...","{'libraries': ['hadoop', 'spark', 'tensorflow'...",2023-08-21 13:38:16
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
785117,Data Scientist,Sr. Data Scientist,United States,via BeBee,Contractor,False,"Texas, United States",2023-01-13 06:06:28,False,False,United States,None,NaN,NaN,"Talent Software Services, Inc.","['python', 'sql', 'mongo', 'oracle']","{'cloud': ['oracle'], 'programming': ['python'...",2023-01-13 06:06:28
785156,Data Scientist,Data Scientist 2,United States,via BeBee,Full-time,False,"Texas, United States",2023-01-13 06:06:23,False,False,United States,None,NaN,NaN,"TalentBurst, Inc.","['r', 'sql', 'snowflake']","{'cloud': ['snowflake'], 'programming': ['r', ...",2023-01-13 06:06:23
785192,Data Scientist,Data Scientist,United States,via BeBee,Full-time,False,"Texas, United States",2023-01-13 06:06:21,False,False,United States,None,NaN,NaN,SMX USA,"['sql', 'python', 'scala']","{'programming': ['sql', 'python', 'scala']}",2023-01-13 06:06:21
785346,Data Scientist,Data Scientist with Security Clearance,United States,via Jobs Trabajo.org,Full-time,False,"Texas, United States",2023-12-14 06:04:56,False,False,United States,None,NaN,NaN,SAIC,"['sql', 't-sql', 'python', 'java', 'c#', 'r', ...","{'analyst_tools': ['tableau'], 'libraries': ['...",2023-12-14 06:04:56
785557,Data Scientist,"Data Scientist, All Levels",United States,via Trabajo.org,Full-time,False,Sudan,2023-10-13 07:15:15,False,True,Sudan,None,NaN,NaN,Independent Software,"['python', 'c', 'shell', 'bash', 'perl']","{'programming': ['python', 'c', 'shell', 'bash...",2023-10-13 07:15:15

In [30]:
# reset_index()
df_usa.reset_index(inplace=True)
df_usa

,job_index,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills,job_posted_data
0,26,Data Engineer,Data Engineer,United States,via LinkedIn,Full-time,False,Georgia,2023-09-15 13:56:18,True,False,United States,None,NaN,NaN,Infinite Computer Solutions,None,None,2023-09-15 13:56:18
1,156,Data Engineer,Data Engineer,United States,via BeBee,Full-time,False,Sudan,2023-11-18 14:20:00,False,False,Sudan,None,NaN,NaN,Tech Tammina,"['sql', 'excel']","{'analyst_tools': ['excel'], 'programming': ['...",2023-11-18 14:20:00
2,339,Data Engineer,Global Market Leading Energy Firm - Staff Data...,United States,via LinkedIn,Full-time,False,"California, United States",2023-09-22 13:07:57,False,False,United States,year,195000.0,NaN,Xcede,None,None,2023-09-22 13:07:57
3,372,Data Scientist,Data Scientist/Analyst,United States,via Trabajo.org,Full-time,False,"Texas, United States",2023-03-25 13:05:35,False,False,United States,None,NaN,NaN,Peraton,['python'],{'programming': ['python']},2023-03-25 13:05:35
4,572,Data Scientist,Data Scientist I,United States,via BeBee,Full-time,False,Sudan,2023-08-21 13:38:16,False,False,Sudan,None,NaN,NaN,MasterCard,"['python', 'r', 'sql', 'hadoop', 'spark', 'ten...","{'libraries': ['hadoop', 'spark', 'tensorflow'...",2023-08-21 13:38:16
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7449,785117,Data Scientist,Sr. Data Scientist,United States,via BeBee,Contractor,False,"Texas, United States",2023-01-13 06:06:28,False,False,United States,None,NaN,NaN,"Talent Software Services, Inc.","['python', 'sql', 'mongo', 'oracle']","{'cloud': ['oracle'], 'programming': ['python'...",2023-01-13 06:06:28
7450,785156,Data Scientist,Data Scientist 2,United States,via BeBee,Full-time,False,"Texas, United States",2023-01-13 06:06:23,False,False,United States,None,NaN,NaN,"TalentBurst, Inc.","['r', 'sql', 'snowflake']","{'cloud': ['snowflake'], 'programming': ['r', ...",2023-01-13 06:06:23
7451,785192,Data Scientist,Data Scientist,United States,via BeBee,Full-time,False,"Texas, United States",2023-01-13 06:06:21,False,False,United States,None,NaN,NaN,SMX USA,"['sql', 'python', 'scala']","{'programming': ['sql', 'python', 'scala']}",2023-01-13 06:06:21
7452,785346,Data Scientist,Data Scientist with Security Clearance,United States,via Jobs Trabajo.org,Full-time,False,"Texas, United States",2023-12-14 06:04:56,False,False,United States,None,NaN,NaN,SAIC,"['sql', 't-sql', 'python', 'java', 'c#', 'r', ...","{'analyst_tools': ['tableau'], 'libraries': ['...",2023-12-14 06:04:56
7453,785557,Data Scientist,"Data Scientist, All Levels",United States,via Trabajo.org,Full-time,False,Sudan,2023-10-13 07:15:15,False,True,Sudan,None,NaN,NaN,Independent Software,"['python', 'c', 'shell', 'bash', 'perl']","{'programming': ['python', 'c', 'shell', 'bash...",2023-10-13 07:15:15

In [32]:
# set_index()

df_usa.set_index('job_index', inplace=True)

In [34]:
df_usa.head()

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills,job_posted_data
job_index,,,,,,,,,,,,,,,,,,
26,Data Engineer,Data Engineer,United States,via LinkedIn,Full-time,False,Georgia,2023-09-15 13:56:18,True,False,United States,None,NaN,NaN,Infinite Computer Solutions,None,None,2023-09-15 13:56:18
156,Data Engineer,Data Engineer,United States,via BeBee,Full-time,False,Sudan,2023-11-18 14:20:00,False,False,Sudan,None,NaN,NaN,Tech Tammina,"['sql', 'excel']","{'analyst_tools': ['excel'], 'programming': ['...",2023-11-18 14:20:00
339,Data Engineer,Global Market Leading Energy Firm - Staff Data...,United States,via LinkedIn,Full-time,False,"California, United States",2023-09-22 13:07:57,False,False,United States,year,195000.0,NaN,Xcede,None,None,2023-09-22 13:07:57
372,Data Scientist,Data Scientist/Analyst,United States,via Trabajo.org,Full-time,False,"Texas, United States",2023-03-25 13:05:35,False,False,United States,None,NaN,NaN,Peraton,['python'],{'programming': ['python']},2023-03-25 13:05:35
572,Data Scientist,Data Scientist I,United States,via BeBee,Full-time,False,Sudan,2023-08-21 13:38:16,False,False,Sudan,None,NaN,NaN,MasterCard,"['python', 'r', 'sql', 'hadoop', 'spark', 'ten...","{'libraries': ['hadoop', 'spark', 'tensorflow'...",2023-08-21 13:38:16

In [35]:
# sort_index()

median_pivot = df_usa.pivot_table(values='salary_year_avg', index='job_title_short', aggfunc=['median', 'min', 'max'])

In [36]:
median_pivot

                                   median             min             max
                          salary_year_avg salary_year_avg salary_year_avg
job_title_short
Business Analyst                 100000.0        100000.0        100000.0
Cloud Engineer                    58000.5         58000.5         58000.5
Data Analyst                      89500.0         52500.0        220000.0
Data Engineer                    127500.0         62500.0        269500.0
Data Scientist                   131280.0         33488.5        351500.0
Machine Learning Engineer        169250.0         99150.0        270000.0
Senior Data Analyst              119450.0         98500.0        240000.0
Senior Data Engineer             154000.0         95000.0        375000.0
Senior Data Scientist            163000.0         76750.0        273555.0
Software Engineer                191000.0        125000.0        217500.0

In [41]:
median_pivot.sort_values(by= ('median','salary_year_avg'), ascending=False)

                                   median             min             max
                          salary_year_avg salary_year_avg salary_year_avg
job_title_short
Software Engineer                191000.0        125000.0        217500.0
Machine Learning Engineer        169250.0         99150.0        270000.0
Senior Data Scientist            163000.0         76750.0        273555.0
Senior Data Engineer             154000.0         95000.0        375000.0
Data Scientist                   131280.0         33488.5        351500.0
Data Engineer                    127500.0         62500.0        269500.0
Senior Data Analyst              119450.0         98500.0        240000.0
Business Analyst                 100000.0        100000.0        100000.0
Data Analyst                      89500.0         52500.0        220000.0
Cloud Engineer                    58000.5         58000.5         58000.5

In [43]:
# sorted according to index , here it is sorted in alphabetical order
median_pivot.sort_index(inplace=True)
median_pivot

                                   median             min             max
                          salary_year_avg salary_year_avg salary_year_avg
job_title_short
Business Analyst                 100000.0        100000.0        100000.0
Cloud Engineer                    58000.5         58000.5         58000.5
Data Analyst                      89500.0         52500.0        220000.0
Data Engineer                    127500.0         62500.0        269500.0
Data Scientist                   131280.0         33488.5        351500.0
Machine Learning Engineer        169250.0         99150.0        270000.0
Senior Data Analyst              119450.0         98500.0        240000.0
Senior Data Engineer             154000.0         95000.0        375000.0
Senior Data Scientist            163000.0         76750.0        273555.0
Software Engineer                191000.0        125000.0        217500.0